app/controllers/awakes_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "awakes" ("awake_time", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["awake_time", "2014-12-14 08:33:46.508111"], ["created_at", "2014-12-14 08:33:46.520810"], ["updated_at", "2014-12-14 08:33:46.520810"], ["user_id", 1]]
---
  def create
    user = User.find(params[:userid])

    if user && awake = user.awakes.create(awake_time: Time.now)