app/controllers/users_controller.rb

  def create
    if user = User.create(username: params[:username])
---
INSERT INTO "users" ("created_at", "updated_at", "username") VALUES (?, ?, ?)  [["created_at", "2014-12-14 07:59:09.992410"], ["updated_at", "2014-12-14 07:59:09.992410"], ["username", "longkt90"]]

  def sleep_cycle
    if user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1 LIMIT 1